Repository: czhovo/chekinana
Catalog: ios/Chekinana/Chekinana/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans, zh_hant

source: The RunPod status response is invalid. Check the server API configuration.
ja: RunPod状態応答が無効です。サーバーのAPI設定を確認してください。
zh_hans: RunPod 状态响应无效。请检查服务器 API 配置。
zh_hant: RunPod 狀態回應無效。請檢查伺服器 API 設定。

source: The RunPod status service is temporarily unavailable. Try again later.
ja: RunPod状態サービスを一時的に利用できません。後でもう一度お試しください。
zh_hans: RunPod 状态服务暂时不可用。请稍后重试。
zh_hant: 暫時無法使用 RunPod 狀態服務。請稍後重試。

source: The selected media is unavailable or invalid.
ja: 選択したメディアは利用できないか無効です。
zh_hans: 所选媒体不可用或无效。
zh_hant: 所選媒體無法使用或無效。

source: The selected photo could not be previewed.
ja: 選択した写真をプレビューできませんでした。
zh_hans: 无法预览所选照片。
zh_hant: 無法預覽所選照片。

source: The staged avatar was cleaned up. The database changes were not saved; review the form and tap Save again, or Cancel.
ja: 準備済みのアバターを削除しました。データベースへの変更は未保存です。フォームを確認して再度「保存」をタップするか、キャンセルしてください。
zh_hans: 已清理暂存头像。数据库更改未保存；请检查表单后再次点按“保存”，或取消。
zh_hant: 已清理暫存頭像。資料庫變更未儲存；請檢查表單後再次點一下「儲存」，或取消。

source: The staged Event/Travel image is unavailable (%@). Keep the draft and try again.
ja: 準備済みのイベント・旅程画像を利用できません（%@）。下書きを保持して再試行してください。
zh_hans: 暂存的活动／行程图片不可用（%@）。请保留草稿后重试。
zh_hant: 無法使用暫存的活動／行程圖片（%@）。請保留草稿後重試。

source: The startup connection was closed. RunPod startup has stopped.
ja: 起動時の接続が閉じられたため、RunPodの起動を停止しました。
zh_hans: 启动连接已关闭，RunPod 启动已停止。
zh_hant: 啟動連線已關閉，RunPod 啟動已停止。

source: The stored Cheki image changed after this edit began. Reopen it and try again.
ja: 編集開始後に保存済みのチェキ画像が変更されました。開き直して再試行してください。
zh_hans: 开始编辑后已保存的拍立得图片发生了变化。请重新打开后再试。
zh_hant: 開始編輯後已儲存的拍立得圖片發生變更。請重新開啟後再試。

source: The target Cheki group has no available index.
ja: 対象のチェキグループに利用可能な番号がありません。
zh_hans: 目标拍立得分组没有可用编号。
zh_hant: 目標拍立得群組沒有可用編號。

source: The temporary RunPod instance stopped running. Try starting it again.
ja: 一時RunPodインスタンスが停止しました。起動を再試行してください。
zh_hans: 临时 RunPod 实例已停止运行。请尝试重新启动。
zh_hant: 臨時 RunPod 執行個體已停止執行。請嘗試重新啟動。

source: The temporary RunPod template or network volume configuration is missing. Check the server configuration.
ja: 一時RunPodのテンプレートまたはネットワークボリュームの設定がありません。サーバー設定を確認してください。
zh_hans: 缺少临时 RunPod 模板或网络存储卷配置。请检查服务器配置。
zh_hant: 缺少臨時 RunPod 範本或網路磁碟區設定。請檢查伺服器設定。

source: The Video is no longer available.
ja: この動画は利用できなくなりました。
zh_hans: 此视频已不可用。
zh_hant: 此影片已無法使用。

source: This Cheki could not be prepared for deletion.
ja: このチェキの削除を準備できませんでした。
zh_hans: 无法准备删除这张拍立得。
zh_hant: 無法準備刪除這張拍立得。

source: This Memory changed or was deleted. Reopen it before saving.
ja: この思い出は変更または削除されました。保存する前に開き直してください。
zh_hans: 此回忆已更改或删除。保存前请重新打开。
zh_hant: 此回憶已變更或刪除。儲存前請重新開啟。

source: This returns to Scan and removes every temporary result and pending input from this scan.
ja: スキャン画面に戻り、このスキャンの一時結果と保留中の入力をすべて削除します。
zh_hans: 这将返回扫描页面，并移除此扫描的全部临时结果和待处理输入。
zh_hant: 這會返回掃描頁面，並移除此掃描的全部暫存結果和待處理輸入。

source: This save task is no longer active. Reopen the draft and try again.
ja: この保存タスクは無効になりました。下書きを開き直して再試行してください。
zh_hans: 此保存任务已失效。请重新打开草稿后再试。
zh_hant: 此儲存任務已失效。請重新開啟草稿後再試。

# travel.add
source: Add trip
ja: 旅程を追加
zh_hans: 添加行程
zh_hant: 新增行程

# travel.arrival
source: Arrival
ja: 到着
zh_hans: 到达
zh_hant: 抵達

# travel.arrival_city
source: Arrival city
ja: 到着都市
zh_hans: 到达城市
zh_hant: 抵達城市

# travel.arrival_location
source: Arrival airport / station and terminal
ja: 到着空港・駅／ターミナル
zh_hans: 到达机场／车站及航站楼
zh_hant: 抵達機場／車站及航廈

# travel.carriage
source: Carriage
ja: 号車
zh_hans: 车厢
zh_hant: 車廂

# travel.choose_icon
source: Choose operator icon
ja: 運行会社アイコンを選択
zh_hans: 选择运营方图标
zh_hant: 選擇營運業者圖示

# travel.delete.confirm
source: Delete this trip?
ja: この旅程を削除しますか？
zh_hans: 删除此行程？
zh_hant: 要刪除此行程嗎？

# travel.departure
source: Departure
ja: 出発
zh_hans: 出发
zh_hant: 出發

# travel.departure_city
source: Departure city
ja: 出発都市
zh_hans: 出发城市
zh_hant: 出發城市

# travel.departure_location
source: Departure airport / station and terminal
ja: 出発空港・駅／ターミナル
zh_hans: 出发机场／车站及航站楼
zh_hant: 出發機場／車站及航廈

# travel.details
source: Trip details
ja: 旅程詳細
zh_hans: 行程详情
zh_hant: 行程詳情

# travel.edit
source: Edit trip
ja: 旅程を編集
zh_hans: 编辑行程
zh_hant: 編輯行程

# travel.error.arrival_before_departure
source: Arrival must not be earlier than departure.
ja: 到着時刻は出発時刻以降にしてください。
zh_hans: 到达时间不得早于出发时间。
zh_hant: 抵達時間不得早於出發時間。

# travel.error.changed_reopen
source: This trip changed or was deleted. Reopen it and try again.
ja: この旅程は変更または削除されました。開き直して再試行してください。
zh_hans: 此行程已更改或删除。请重新打开后再试。
zh_hant: 此行程已變更或刪除，請重新開啟後再試。

# travel.error.required
source: Enter the service number, cities, locations, and departure and arrival times.
ja: 便名・列車番号、都市、場所、出発・到着時刻を入力してください。
zh_hans: 请填写航班号／车次、起终城市和地点以及出发和到达时间。
zh_hant: 請填寫航班編號／車次、出發與抵達的城市和地點，以及出發與抵達時間。

# travel.flight_number
source: Flight number
ja: 便名
zh_hans: 航班号
zh_hant: 航班編號

# travel.mode
source: Mode
ja: 交通手段
zh_hans: 交通方式
zh_hant: 交通方式

# travel.mode.flight
source: Flight
ja: 飛行機
zh_hans: 航班
zh_hant: 航班

# travel.mode.train
source: Train
ja: 鉄道
zh_hans: 列车
zh_hant: 列車

# travel.operator
source: Operator
ja: 運行会社
zh_hans: 运营方
zh_hant: 營運業者

# travel.operator.custom
source: Other
ja: その他
zh_hans: 其他
zh_hant: 其他

# travel.route
source: Route
ja: 経路
zh_hans: 路线
zh_hant: 路線

# travel.schedule
source: Schedule
ja: 時刻
zh_hans: 时间
zh_hant: 時間

# travel.seat
source: Seat
ja: 座席
zh_hans: 座位
zh_hant: 座位

# travel.seat_details
source: Seat details
ja: 座席情報
zh_hans: 座位信息
zh_hant: 座位資訊

# travel.title
source: Trip
ja: 旅程
zh_hans: 行程
zh_hant: 行程

# travel.train_number
source: Train number
ja: 列車番号
zh_hans: 车次
zh_hant: 車次

source: Try another name, group, or note.
ja: 別の名前、グループ、メモでお試しください。
zh_hans: 请尝试其他名称、团体或备注。
zh_hant: 請嘗試其他名稱、團體或備註。

source: Unable to add media
ja: メディアを追加できません
zh_hans: 无法添加媒体
zh_hant: 無法新增媒體

source: Unable to update date
ja: 日付を更新できません
zh_hans: 无法更新日期
zh_hant: 無法更新日期

source: Unable to update Idol
ja: アイドルを更新できません
zh_hans: 无法更新偶像
zh_hant: 無法更新偶像

source: Unassigned
ja: 未割り当て
zh_hans: 未分配
zh_hant: 未分配

source: Unavailable
ja: 利用不可
zh_hans: 不可用
zh_hant: 無法使用

source: Unknown pattern ID: %@
ja: 不明なパターンID：%@
zh_hans: 未知的模式 ID：%@
zh_hant: 未知的模式 ID：%@

source: Unset
ja: 未設定
zh_hans: 未设置
zh_hant: 未設定

source: unterminated quote
ja: 引用符が閉じられていません
zh_hans: 引号未闭合
zh_hant: 引號未閉合

source: use - to clear an optional field; quote values containing spaces
ja: 任意フィールドを消去するには - を使用し、空白を含む値は引用符で囲んでください
zh_hans: 使用 - 清空可选字段；包含空格的值请加引号
zh_hant: 使用 - 清空選填欄位；包含空格的值請加引號

source: use ? or - to clear user/size and - to clear note
ja: user/sizeを消去するには ? または -、noteを消去するには - を使用します
zh_hans: 使用 ? 或 - 清空 user/size，使用 - 清空 note
zh_hant: 使用 ? 或 - 清空 user/size，使用 - 清空 note

source: Use %@ catalogue information
ja: %@のカタログ情報を使用
zh_hans: 使用%@的偶像资料库信息
zh_hant: 使用 %@ 的偶像資料庫資訊

source: Use selected date
ja: 選択した日付を使用
zh_hans: 使用所选日期
zh_hant: 使用所選日期

# user 必须是 true、false、? 或 -
source: user must be true, false, ?, or -.
ja: userにはtrue、false、?、-のいずれかを指定してください。
zh_hans: user 必须是 true、false、? 或 -。
zh_hant: user 必須是 true、false、? 或 -。

source: uses selected album photos; idol, event, date, and other metadata are optional; this command never uses scancheki temporary objects
ja: 選択したアルバム写真を使用します。idol、event、dateなどの情報は任意です。このコマンドはscanchekiの一時オブジェクトを使用しません
zh_hans: 使用已选相册照片；idol、event、date 等信息可选；此命令不使用 scancheki 临时对象
zh_hant: 使用已選相簿照片；idol、event、date 等資訊可選填；此指令不使用 scancheki 暫存物件

source: Verification
ja: 認証情報
zh_hans: 认证信息
zh_hant: 驗證資訊

source: Wait for the selected avatar to finish loading, or retry or cancel the selection.
ja: 選択したアバターの読み込みが完了するまで待つか、再試行または選択のキャンセルを行ってください。
zh_hans: 请等待所选头像加载完成，或重试、取消选择。
zh_hant: 請等待所選頭像載入完成，或重試、取消選擇。

# 一次只能转换一个操作，请拆开描述
source: Only one operation can be interpreted at a time. Describe each operation separately.
ja: 一度に解釈できる操作は1つだけです。操作ごとに分けて説明してください。
zh_hans: 一次只能转换一个操作，请拆开描述。
zh_hant: 一次只能轉換一個操作，請分開描述。

# 八位确认码已规范化
source: The eight-character confirmation code was normalized.
ja: 8文字の確認コードを正規化しました。
zh_hans: 八位确认码已规范化。
zh_hant: 八位確認碼已正規化。

# 关闭 Cheki 详情
source: Close Cheki details
ja: チェキ詳細を閉じる
zh_hans: 关闭拍立得详情
zh_hant: 關閉拍立得詳情

# 关闭侧边栏
source: Close sidebar
ja: サイドバーを閉じる
zh_hans: 关闭侧边栏
zh_hant: 關閉側邊欄

# 关闭连连看
source: Close Link Link
ja: リンクリンクを閉じる
zh_hans: 关闭连连看
zh_hant: 關閉連連看

# 关闭预览
source: Close preview
ja: プレビューを閉じる
zh_hans: 关闭预览
zh_hant: 關閉預覽

# 参数包含无法表示的双引号
source: The argument contains double quotes that cannot be represented.
ja: 引数に表現できない二重引用符が含まれています。
zh_hans: 参数包含无法表示的双引号。
zh_hant: 參數包含無法表示的雙引號。

# 双引号只能包围完整参数值
source: Double quotes must surround a complete argument value.
ja: 二重引用符は引数の値全体を囲む必要があります。
zh_hans: 双引号只能包围完整参数值。
zh_hant: 雙引號只能包圍完整參數值。

# 反斜杠无法由 App parser 无损处理
source: The app parser cannot handle backslashes without changing the input.
ja: アプリのパーサーではバックスラッシュをそのまま処理できません。
zh_hans: 应用解析器无法完整处理反斜杠。
zh_hant: App 解析器無法完整處理反斜線。

# 命令引号不完整
source: The command contains an unclosed quote.
ja: コマンドの引用符が閉じられていません。
zh_hans: 命令引号不完整。
zh_hant: 指令引號不完整。

# 命令有效
source: The command is valid.
ja: コマンドは有効です。
zh_hans: 命令有效。
zh_hant: 指令有效。

# 图案 %lld
source: Pattern %lld
ja: パターン%lld
zh_hans: 图案%lld
zh_hant: 圖案 %lld

# 字段必须使用 field=value，且 value 不能为空
source: Fields must use field=value, and value must not be empty.
ja: フィールドはfield=valueの形式で指定し、valueを空にしないでください。
zh_hans: 字段必须使用 field=value，且 value 不能为空。
zh_hant: 欄位必須使用 field=value，且 value 不可留空。

# 字段重复：%@
source: Duplicate field: %@
ja: フィールドが重複しています：%@
zh_hans: 字段重复：%@
zh_hant: 欄位重複：%@

# 已保留正常结果；有 %lld 项未完成，请检查自动识别属性
source: Valid results were kept; %lld item(s) remain incomplete. Check the automatically recognized attributes.
ja: 正常な結果は保持されました。%lld件が未完了です。自動認識された属性を確認してください。
zh_hans: 已保留正常结果；有%lld项未完成，请检查自动识别属性。
zh_hant: 已保留正常結果；有 %lld 項未完成，請檢查自動識別欄位。

# 必须先点 Delete 完成图片恢复或清理
source: Tap Delete first to finish restoring or cleaning up the image
ja: 先に「削除」をタップして画像の復元またはクリーンアップを完了してください
zh_hans: 必须先点按“删除”以完成图片恢复或清理
zh_hant: 請先點選「刪除」，以完成圖片復原或清理

# 批量添加 Idol 需要至少两个非空名称；请用空格、顿号、逗号或“和”分隔。
source: Adding multiple Idols requires at least two non-empty names. Separate them with spaces, commas, “、”, or “和”.
ja: 複数のアイドルを追加するには、空でない名前が2つ以上必要です。スペース、カンマ、「、」、または「和」で区切ってください。
zh_hans: 批量添加偶像需要至少两个非空名称；请用空格、顿号、逗号或“和”分隔。
zh_hant: 批次新增偶像需要至少兩個非空名稱；請用空格、頓號、逗號或「和」分隔。

# 播放
source: Play
ja: 再生
zh_hans: 播放
zh_hant: 播放

# 日期变化会保留仍存在的已选 Event；清除日期不会移除原图。
source: Changing the date keeps a selected Event that still exists; clearing the date does not remove the original image.
ja: 日付を変更しても、現在存在する選択済みイベントは保持されます。日付を消去しても元の画像は削除されません。
zh_hans: 日期变化会保留仍存在的已选活动；清除日期不会移除原图。
zh_hant: 變更日期時，仍存在的已選活動會保留；清除日期不會移除原圖。

# 日期未识别
source: Date not recognized
ja: 日付未認識
zh_hans: 日期未识别
zh_hant: 日期未識別

# 暂停
source: Pause
ja: 一時停止
zh_hans: 暂停
zh_hant: 暫停

# 未注册命令：%@
source: Unregistered command: %@
ja: 未登録のコマンド：%@
zh_hans: 未注册命令：%@
zh_hant: 未註冊的指令：%@

# 添加 Idol
source: Add Idol
ja: アイドルを追加
zh_hans: 添加偶像
zh_hant: 新增偶像

# 直接处理已选照片并显示可编辑的临时 Cheki
source: Process selected photos directly and show editable temporary Cheki
ja: 選択した写真を直接処理し、編集可能な一時チェキを表示します
zh_hans: 直接处理已选照片并显示可编辑的临时拍立得
zh_hant: 直接處理已選照片，並顯示可編輯的暫存拍立得

# 确认码必须是八位十六进制字符
source: The confirmation code must contain eight hexadecimal characters.
ja: 確認コードは16進数8文字である必要があります。
zh_hans: 确认码必须是八位十六进制字符。
zh_hant: 確認碼必須是八位十六進位字元。

# 离线规则无法确定唯一命令，请补充或改写需求
source: Offline rules could not identify a single command. Add details or rephrase your request.
ja: オフラインルールではコマンドを1つに特定できませんでした。情報を追加するか、言い換えてください。
zh_hans: 离线规则无法确定唯一命令，请补充或改写需求。
zh_hant: 離線規則無法確定唯一指令，請補充或重新描述需求。

# 空白
source: Blank
ja: 空白
zh_hans: 空白
zh_hant: 空白

# 结束引号后必须是参数分隔空白
source: A closing quote must be followed by whitespace separating arguments.
ja: 閉じ引用符の後には、引数を区切る空白が必要です。
zh_hans: 结束引号后必须是参数分隔空白。
zh_hant: 結束引號後必須是分隔參數的空白。

# 缺少必要参数
source: Required arguments are missing.
ja: 必須の引数がありません。
zh_hans: 缺少必要参数。
zh_hant: 缺少必要參數。

# 解答
source: Answer
ja: 解答
zh_hans: 答案
zh_hant: 答案

# 识别为下载 Cheki；执行仍需确认
source: Interpreted as downloading a Cheki; confirmation is still required.
ja: チェキをダウンロードする操作と解釈しました。実行には確認が必要です。
zh_hans: 识别为下载拍立得；执行仍需确认。
zh_hant: 辨識為下載拍立得；執行仍需確認。

# 识别为丢弃临时 Cheki
source: Interpreted as discarding temporary Cheki.
ja: 一時チェキを破棄する操作と解釈しました。
zh_hans: 识别为丢弃临时拍立得。
zh_hant: 辨識為捨棄暫存拍立得。

# 识别为从相册为 Idol 添加 Cheki；执行仍需确认
source: Interpreted as adding Cheki from the photo library to an Idol; confirmation is still required.
ja: 写真ライブラリからアイドルにチェキを追加する操作と解釈しました。実行には確認が必要です。
zh_hans: 识别为从相册为偶像添加拍立得；执行仍需确认。
zh_hant: 辨識為從相簿為偶像新增拍立得；執行仍需確認。

# 识别为保存全部扫描结果；执行仍需确认
source: Interpreted as saving all scan results; confirmation is still required.
ja: すべてのスキャン結果を保存する操作と解釈しました。実行には確認が必要です。
zh_hans: 识别为保存全部扫描结果；执行仍需确认。
zh_hant: 辨識為儲存所有掃描結果；執行仍需確認。

# 识别为修改 Cheki；执行仍需确认
source: Interpreted as editing a Cheki; confirmation is still required.
ja: チェキを編集する操作と解釈しました。実行には確認が必要です。
zh_hans: 识别为修改拍立得；执行仍需确认。
zh_hant: 辨識為修改拍立得；執行仍需確認。

# 识别为修改 Event；执行仍需确认
source: Interpreted as editing an Event; confirmation is still required.
ja: イベントを編集する操作と解釈しました。実行には確認が必要です。
zh_hans: 识别为修改活动；执行仍需确认。
zh_hant: 辨識為修改活動；執行仍需確認。

# 识别为修改 Idol 字段；执行仍需确认
source: Interpreted as editing an Idol field; confirmation is still required.
ja: アイドルのフィールドを編集する操作と解釈しました。実行には確認が必要です。
zh_hans: 识别为修改偶像字段；执行仍需确认。
zh_hant: 辨識為修改偶像欄位；執行仍需確認。

# 识别为修改 Idol 颜色；执行仍需确认
source: Interpreted as changing an Idol’s color; confirmation is still required.
ja: アイドルのカラーを変更する操作と解釈しました。実行には確認が必要です。
zh_hans: 识别为修改偶像颜色；执行仍需确认。
zh_hant: 辨識為修改偶像顏色；執行仍需確認。

# 识别为列出 Cheki
source: Interpreted as listing Cheki.
ja: チェキを一覧表示する操作と解釈しました。
zh_hans: 识别为列出拍立得。
zh_hant: 辨識為列出拍立得。

# 识别为列出 Event
source: Interpreted as listing Events.
ja: イベントを一覧表示する操作と解釈しました。
zh_hans: 识别为列出活动。
zh_hant: 辨識為列出活動。

# 识别为列出本地 Idol
source: Interpreted as listing local Idols.
ja: ローカルのアイドルを一覧表示する操作と解釈しました。
zh_hans: 识别为列出本地偶像。
zh_hant: 辨識為列出本機偶像。

# 识别为删除 Cheki；执行仍需确认
source: Interpreted as deleting a Cheki; confirmation is still required.
ja: チェキを削除する操作と解釈しました。実行には確認が必要です。
zh_hans: 识别为删除拍立得；执行仍需确认。
zh_hant: 辨識為刪除拍立得；執行仍需確認。

# 识别为删除 Event；执行仍需确认
source: Interpreted as deleting an Event; confirmation is still required.
ja: イベントを削除する操作と解釈しました。実行には確認が必要です。
zh_hans: 识别为删除活动；执行仍需确认。
zh_hant: 辨識為刪除活動；執行仍需確認。

# 识别为删除 Idol；执行仍需确认
source: Interpreted as deleting an Idol; confirmation is still required.
ja: アイドルを削除する操作と解釈しました。実行には確認が必要です。
zh_hans: 识别为删除偶像；执行仍需确认。
zh_hant: 辨識為刪除偶像；執行仍需確認。

# 识别为取消全部待确认操作
source: Interpreted as cancelling all pending operations.
ja: 確認待ちのすべての操作をキャンセルすると解釈しました。
zh_hans: 识别为取消全部待确认操作。
zh_hant: 辨識為取消所有待確認操作。

# 识别为取消指定操作
source: Interpreted as cancelling the specified operation.
ja: 指定した操作をキャンセルすると解釈しました。
zh_hans: 识别为取消指定操作。
zh_hant: 辨識為取消指定操作。

# 识别为扫描已选照片；后端会在需要时自动启动
source: Interpreted as scanning the selected photos; the backend will start automatically if needed.
ja: 選択した写真をスキャンする操作と解釈しました。必要に応じてバックエンドが自動起動します。
zh_hans: 识别为扫描已选照片；后端会在需要时自动启动。
zh_hant: 辨識為掃描已選照片；後端會在需要時自動啟動。

# 识别为批量添加 Idol
source: Interpreted as adding multiple Idols.
ja: 複数のアイドルを追加する操作と解釈しました。
zh_hans: 识别为批量添加偶像。
zh_hant: 辨識為批次新增偶像。

# 识别为把扫描临时对象添加给 Idol；执行仍需确认
source: Interpreted as adding temporary scan results to an Idol; confirmation is still required.
ja: 一時スキャン結果をアイドルに追加する操作と解釈しました。実行には確認が必要です。
zh_hans: 识别为把扫描临时结果添加给偶像；执行仍需确认。
zh_hant: 辨識為將掃描暫存結果新增至偶像；執行仍需確認。

# 识别为指定确认码
source: Interpreted as providing a confirmation code.
ja: 確認コードを指定する操作と解釈しました。
zh_hans: 识别为指定确认码。
zh_hant: 辨識為指定確認碼。

# 识别为按 Idol 筛选 Cheki
source: Interpreted as filtering Cheki by Idol.
ja: アイドルでチェキを絞り込む操作と解釈しました。
zh_hans: 识别为按偶像筛选拍立得。
zh_hant: 辨識為依偶像篩選拍立得。

# 识别为搜索并添加 Idol
source: Interpreted as searching for and adding an Idol.
ja: アイドルを検索して追加する操作と解釈しました。
zh_hans: 识别为搜索并添加偶像。
zh_hant: 辨識為搜尋並新增偶像。

# 识别为查看 Cheki
source: Interpreted as viewing a Cheki.
ja: チェキを表示する操作と解釈しました。
zh_hans: 识别为查看拍立得。
zh_hant: 辨識為查看拍立得。

# 识别为查看 Event
source: Interpreted as viewing an Event.
ja: イベントを表示する操作と解釈しました。
zh_hans: 识别为查看活动。
zh_hant: 辨識為查看活動。

# 识别为查看 Idol
source: Interpreted as viewing an Idol.
ja: アイドルを表示する操作と解釈しました。
zh_hans: 识别为查看偶像。
zh_hant: 辨識為查看偶像。

# 识别为查看帮助
source: Interpreted as viewing help.
ja: ヘルプを表示する操作と解釈しました。
zh_hans: 识别为查看帮助。
zh_hant: 辨識為查看說明。

# 识别为添加带 URL 的 Event；执行仍需确认
source: Interpreted as adding an Event with a URL; confirmation is still required.
ja: URL付きのイベントを追加する操作と解釈しました。実行には確認が必要です。
zh_hans: 识别为添加带 URL 的活动；执行仍需确认。
zh_hant: 辨識為新增含 URL 的活動；執行仍需確認。

# 识别为清空 Cheki 关联；执行仍需确认
source: Interpreted as clearing Cheki relationships; confirmation is still required.
ja: チェキの関連付けを解除する操作と解釈しました。実行には確認が必要です。
zh_hans: 识别为清空拍立得关联；执行仍需确认。
zh_hant: 辨識為清空拍立得關聯；執行仍需確認。

# 识别为清空 Idol 字段；执行仍需确认
source: Interpreted as clearing an Idol field; confirmation is still required.
ja: アイドルのフィールドを消去する操作と解釈しました。実行には確認が必要です。
zh_hans: 识别为清空偶像字段；执行仍需确认。
zh_hant: 辨識為清空偶像欄位；執行仍需確認。

# 识别为清空可见记录
source: Interpreted as clearing visible records.
ja: 表示中の記録を消去する操作と解釈しました。
zh_hans: 识别为清空可见记录。
zh_hant: 辨識為清空可見記錄。

# 识别为确认最近操作
source: Interpreted as confirming the latest operation.
ja: 直前の操作を確認する操作と解釈しました。
zh_hans: 识别为确认最近操作。
zh_hant: 辨識為確認最近的操作。

# 识别为通过名称和日期添加 Event；执行仍需确认
source: Interpreted as adding an Event by name and date; confirmation is still required.
ja: 名前と日付でイベントを追加する操作と解釈しました。実行には確認が必要です。
zh_hans: 识别为通过名称和日期添加活动；执行仍需确认。
zh_hant: 辨識為透過名稱和日期新增活動；執行仍需確認。

# 请补充要添加的 Idol 名称。
source: Enter the name of the Idol to add.
ja: 追加するアイドルの名前を入力してください。
zh_hans: 请补充要添加的偶像名称。
zh_hant: 請補充要新增的偶像名稱。

# 请输入一个需求
source: Enter a request.
ja: リクエストを入力してください。
zh_hans: 请输入一个需求。
zh_hant: 請輸入一個需求。

# 输入为空
source: The input is empty.
ja: 入力が空です。
zh_hans: 输入为空。
zh_hant: 輸入為空。

# 输入包含换行或命令控制字符
source: The input contains line breaks or command control characters.
ja: 入力に改行またはコマンド制御文字が含まれています。
zh_hans: 输入包含换行或命令控制字符。
zh_hant: 輸入包含換行或指令控制字元。

# 输入包含换行或命令控制字符，已拒绝转换
source: The input contains line breaks or command control characters and was not converted.
ja: 入力に改行またはコマンド制御文字が含まれるため、変換しませんでした。
zh_hans: 输入包含换行或命令控制字符，已拒绝转换。
zh_hant: 輸入包含換行或指令控制字元，已拒絕轉換。

# 输入参数无法由 App parser 无损表示
source: The app parser cannot represent these input arguments without changing them.
ja: アプリのパーサーでは入力引数をそのまま表現できません。
zh_hans: 应用解析器无法完整表示输入参数。
zh_hant: App 解析器無法完整表示輸入參數。

# 还需要 Event %@，已保留 URL。
source: The Event still needs %@. The URL was preserved.
ja: イベントにはまだ%@が必要です。URLは保持されています。
zh_hans: 还需要活动的%@，已保留 URL。
zh_hant: 還需要活動的%@，已保留 URL。

# 还需要 Event 名称和日期，已保留 URL。
source: The Event name and date are still needed. The URL was preserved.
ja: イベント名と日付が必要です。URLは保持されています。
zh_hans: 还需要活动名称和日期，已保留 URL。
zh_hant: 還需要活動名稱和日期，已保留 URL。

# 还需要 Event 名称和日期；URL 可以稍后附加。
source: The Event name and date are still needed; the URL can be added later.
ja: イベント名と日付が必要です。URLは後から追加できます。
zh_hans: 还需要活动名称和日期；URL 可以稍后附加。
zh_hant: 還需要活動名稱和日期；URL 可以稍後附加。

# 还需要一个或多个 Idol，并填写日期；Event 可选。
source: Choose one or more Idols and enter a date; the Event is optional.
ja: アイドルを1人以上選択し、日付を入力してください。イベントは任意です。
zh_hans: 还需要一个或多个偶像，并填写日期；活动可选。
zh_hant: 還需要一位或多位偶像，並填寫日期；活動可選填。

# 还需要填写日期；Event 可选。
source: A date is still required; the Event is optional.
ja: 日付の入力が必要です。イベントは任意です。
zh_hans: 还需要填写日期；活动可选。
zh_hant: 還需要填寫日期；活動可選填。

# 连连看
source: Link Link
ja: リンクリンク
zh_hans: 连连看
zh_hant: 連連看

# 通过 URL 添加 Event 时必须同时提供 name 和 date
source: Adding an Event by URL requires both name and date.
ja: URLからイベントを追加する場合は、nameとdateの両方が必要です。
zh_hans: 通过 URL 添加活动时必须同时提供 name 和 date。
zh_hant: 透過 URL 新增活動時必須同時提供 name 和 date。

# 通过名称添加 Event 时必须提供 date
source: Adding an Event by name requires date.
ja: 名前でイベントを追加する場合は、dateが必要です。
zh_hans: 通过名称添加活动时必须提供 date。
zh_hant: 透過名稱新增活動時必須提供 date。

# 通过名称添加 Event 时还需要 YYYY-MM-DD 日期。
source: Adding an Event by name also requires a date in YYYY-MM-DD format.
ja: 名前でイベントを追加するには、YYYY-MM-DD形式の日付も必要です。
zh_hans: 通过名称添加活动时还需要 YYYY-MM-DD 日期。
zh_hant: 透過名稱新增活動時還需要 YYYY-MM-DD 日期。

# 重置
source: Reset
ja: リセット
zh_hans: 重置
zh_hant: 重設

source: OK
zh_hans: 好
zh_hant: 好

# product.assistant.executor.field.weibo
source: Weibo: %@
zh_hans: 微博：%@

# product.common.ok
source: OK
zh_hans: 好
zh_hant: 好
